<!--[                  By DeltaЛох блять                  ]-->
<script>
    import icon         from '$image/de_icon/favicon.png';

    import PageContent  from './layout/PageContent.svelte';

    const title = "$ DeltaCion 🍷";
</script>               <!--[                   Imports ]-->

<style lang="scss">
    @use '$styles/MainStyle.scss' as *;
    @use '$styles/TextStyles.scss' as *;
</style>                <!--[                   Styles  ]-->

<svelte:head>
    <title>{title}</title>
    <link rel="icon" href={icon} type="image/x-icon">
    <meta name="description" content="Bruh">
</svelte:head>          <!--[                   Head    ]-->

<div class="main-div">
    <div class="content-main">
        <PageContent/>
    </div>
</div>                  <!--[                   Content ]-->


<!--[ 

Я в душе не ебу, кто придумал эти ебучие фреймворки 
Это ужасно, это неудобно, непрактично и всё вот это вот.
Мне из всей горы этого вонючео мусора нужен был лишь ебучий шаблонизатор для html.
По итогу мне пришлось тянуть кучу неудобного мусора, лишь бы написать что-то, что я мог бы сделать проще и быстрее, без ваших ебучих фреймворков.

В целом я не ебу нахуй я это делаю. Ещё на середине этого сайта (А я пишу этот ебейший текст именно на середине) - 
Уже понятно, что это лишнее хламье.
По сути решение простое - Написать свой шаблонизатор (На go/python), чем я возможно займусь в перерыве между очередным выгоранием, мечтами о роскомпозоре в окно и учебой.

ts объективно говно, как и весь веб в целом.
npm тянет гору пакетов, которые даже не используются по назначеннию.
Казалось бы - Шаблонизатор по типу svelte должен просто добавлять скрипты со страничками в конечный проект. Да? Правда ведь? А вот нихуя
По умолчанию, по официальным ебейшим гайдам он танет ебучий sveltekit, который содержит в себе роуты, vite, ts, кучу выборов говна, которое ты никогда не будешь использовать

Если зайти в ебучую папку node_modules (А она обычно не летит на гитхаб, ибо весит дохуя) - 
Можно увидеть - кучу [КУЧУ НАХУЙ] зависимостей, которые АПРИОРИ нахуй никак не связаны с шаблонами
Нахуя мне дебагер в комплекте? Нахуя мне конфиги от ts? Зачем мне parcel? ЧТО ТАКОЕ НАХУЙ PARCEL???

Весь этот набор шедеврофронта убивает понимание используемого тобой софта НАХУЙ
Уже несколько раз случались ебейшие ситуации, когда какой то далбаеб в корневую либу грузил троян и по итогу отлетали ВСЕ ЛИБЫ НАХУЙ
Потому что ты не знаешь, что ты используешь
А если и знаешь - ТО разраб уже того, что ТЫ используешь - Использует что-то ЕЩЁ, из-за чего получается пакет-в_пакете-в_пакете-в_пакете-в_пакете- х500

Это ужасно.
Я не лезу в веб именно по этой причине.

Объективно оригинальные js, html, css устарели. Да, они неудобные. Но они сука работают
Все фреймворки в конце концов компилятся именно в НИХ
Т.е если ты умеешь быстро и много писать на оригинале - Тебе фреймворки не нужны?
Нужны. Просто не в таком виде.

Что мешает написать нормальную систему сборки на подобии gradle/maven/crate_(rust)/подставить_красивое?
По сути ничего. Вероятно изначальная идея npm именно в этом. Просто она была проебана со временем.
А следовательно исправить это сейчас уже невозможно.

]-->